Repository: nKey/schematics
Catalog: schematics/locale/*/LC_MESSAGES/schematics.po
Languages: pt_br

source: %s is an illegal field.
pt_br: %s é um campo inválido.

source: This field is required.
pt_br: Este campo é obrigatório.

source: Value must be one of {}.
pt_br: Valor deve ser um dos {}.

source: Illegal data value
pt_br: Valor para dados inválido

source: String value is too long
pt_br: Valor do texto é muito grande

source: String value is too short
pt_br: Valor do texto é muito pequeno

source: String value did not match validation regex
pt_br: Valor do texto não corresponde com a expressão regular

source: Not a well formed email address.
pt_br: Endereço de e-mail inválido.

source: Not {}
pt_br: Não {}

source: {} value should be greater than {}
pt_br: {} deve ser maior que {}

source: {} value should be less than {}
pt_br: {} deve ser menor que {}

source: Hash value is wrong length.
pt_br: Hash tem o tamanho errado.

source: Hash value is not hexadecimal.
pt_br: Hash não é hexadecimal.

source: Must be either true or false.
pt_br: Deve ser 'true' ou 'falso'

source: Could not parse {}. Should be ISO8601 (YYYY-MM-DD).
pt_br: Campo {} não está no formato ISO8601 (YYYY-MM-DD).

source: Could not parse {}. Should be ISO8601.
pt_br: Campo {} não está no formato ISO8601.

source: Please use a mapping for this field or {} instance instead of {}.
pt_br: Por favor use um mapa para este campo ou {} instância ao invés de {}.

source: Please provide at least %d item.
pt_br: Por favor forneca no mínimo %d item.

source: Please provide at least %d items.
pt_br: Por favor forneça no mínimo %d itens.

source: Please provide no more than %d item.
pt_br: Por favor não forneça mais de %d item.

source: Please provide no more than %d items.
pt_br: Por favor não forneça mais de %d itens.

source: Only dictionaries may be used in a DictType
pt_br: Somente dicionários (dict) podem ser utilizados em um DictType
